# 1) Datasets

Vamos a leer el dataset que envía PyP

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('/mnt/c/users/Dleg/Data/MOPC/MOPC/Enriquecimiento de Datos/Data Cleaning/PyP/Datasets/Datasets recibidos/MOP - 11022021 -Enriquecido - Copy.xlsx',skiprows=2, header=[0,1])

In [3]:
df.head()

  Unnamed: 0_level_0 Unnamed: 1_level_0 Unnamed: 2_level_0 Unnamed: 3_level_0  \
                Cuil                Dni      Fecha de Nac. Fecha de Defuncion
0        20140531562           14053156         1959-10-12                NaN
1        27281648867           28164886         1980-09-14                NaN
2        20398295383           39829538         1996-07-25                NaN
3        20359239530           35923953         1992-02-12                NaN
4        20939121383           93912138         1992-12-11                NaN

  Unnamed: 4_level_0             Unnamed: 5_level_0     Unnamed: 6_level_0  \
                Sexo                        Titular                  Calle
0                  M          CALDERON JUAN DOMINGO                CALLE 8
1                  F             BAEZ CECILIA LUJAN              VILLAGUAY
2                  M       CARDOZO SANTIAGO EDUARDO          PRES QUINTANA
3                  M  BUSTOS CLEVERS CARLOS OCTAVIO  CARLOS M ALVEAR NORTE
4                  M     BENEGA LOPEZ ARNALDO ARIEL               CALLE 22

  Unnamed: 7_level_0 Unnamed: 8_level_0 Unnamed: 9_level_0  ...  \
              Numero       Piso y Depto      Codigo Postal  ...
0                378                NaN               2555  ...
1               2130                NaN               1849  ...
2               1723                NaN               1615  ...
3                143                NaN               5400  ...
4                170                NaN               1743  ...

  Contactacion Opcional (Familiar)                                    \
                        Tel Fijo 2     Celular 1 Celular 2 Celular 3
0                              NaN           NaN       NaN       NaN
1                              NaN           NaN       NaN       NaN
2                              NaN           NaN       NaN       NaN
3                              NaN  2.646737e+09       NaN       NaN
4                              NaN           NaN       NaN       NaN

                            Contactacion Opcional (Vecino)
  Celular 4 Celular 5 Email                         Nombre      Telefono SCORE
0       NaN       NaN   NaN                            NaN           NaN   345
1       NaN       NaN   NaN                   LUJAN OLGA Y  1.142688e+09    34
2       NaN       NaN   NaN                            NaN           NaN   345
3       NaN       NaN   NaN                            NaN           NaN   345
4       NaN       NaN   NaN                            NaN           NaN   345

[5 rows x 229 columns]

In [4]:
df.shape

(1348, 229)

## 1.2) Data Cleaning: Datasets

Vamos a dropear aquellas columnas y filas que no tengan ningún valor (es decir, que sean todos NaNs)

In [5]:
df = df.dropna(axis=0, how='all')

In [6]:
#df = df.dropna(axis=1, how='all')

In [7]:
df.shape

(1348, 229)

Ahora todas las columnas tienen al menos 1 dato.

# 2) Vehículos

Vamos a obtener los teléfonos de las columnas donde pueden aparecer, que son:

Bienes registrados (Titular): 
- Patentados 2020-2001, Patentados menor al año 2001. __No__ me sirve tener la cantidad de patentados por el momento, ya que tengo sólo datos del último vehículo patentado.
- Dominio: corresponde al dominio del último vehículo patentado.
- Fecha Automotor (año de fabricación del vehículo).
- Fecha de Compra.
- Marca.
- Modelo.

In [8]:
df_reduced = df [[('Unnamed: 0_level_0','Cuil'),('Unnamed: 1_level_0','Dni'), ('Unnamed: 5_level_0','Titular')
                  ,('Dominio','DdOMIN'),('Fecha Automotor','Unnamed: 134_level_1')
                  ,('Fecha de Compra','Unnamed: 135_level_1'),('Marca','Unnamed: 136_level_1')
                  ,('Modelo','Unnamed: 137_level_1')
                  ]]

In [9]:
df_reduced.head()

,Unnamed: 0_level_0,Unnamed: 1_level_0,Unnamed: 5_level_0,Dominio,Fecha Automotor,Fecha de Compra,Marca,Modelo
,Cuil,Dni,Titular,DdOMIN,Unnamed: 134_level_1,Unnamed: 135_level_1,Unnamed: 136_level_1,Unnamed: 137_level_1
0,20140531562,14053156,CALDERON JUAN DOMINGO,NaN,- -,- -,NaN,NaN
1,27281648867,28164886,BAEZ CECILIA LUJAN,NaN,- -,- -,NaN,NaN
2,20398295383,39829538,CARDOZO SANTIAGO EDUARDO,NaN,- -,- -,NaN,NaN
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4
4,20939121383,93912138,BENEGA LOPEZ ARNALDO ARIEL,NaN,- -,- -,NaN,NaN

In [10]:
df_reduced.shape

(1348, 8)

Eliminamos el multilevel de las columnas, y las renombramos:

In [11]:
df_reduced.columns = df_reduced.columns.droplevel()

In [12]:
df_reduced.head()

,Cuil,Dni,Titular,DdOMIN,Unnamed: 134_level_1,Unnamed: 135_level_1,Unnamed: 136_level_1,Unnamed: 137_level_1
0,20140531562,14053156,CALDERON JUAN DOMINGO,NaN,- -,- -,NaN,NaN
1,27281648867,28164886,BAEZ CECILIA LUJAN,NaN,- -,- -,NaN,NaN
2,20398295383,39829538,CARDOZO SANTIAGO EDUARDO,NaN,- -,- -,NaN,NaN
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4
4,20939121383,93912138,BENEGA LOPEZ ARNALDO ARIEL,NaN,- -,- -,NaN,NaN

In [13]:
df_reduced = df_reduced.rename(columns={"Cuil": "CUIT_CUIL", 'Dni': 'NRO_DOC', 'DdOMIN':'PATENTE', 'Unnamed: 134_level_1':'ANO'
                                       ,'Unnamed: 135_level_1':'FECHA_DE_COMPRA','Unnamed: 136_level_1':'MARCA'
                                       ,'Unnamed: 137_level_1':'MODELO'})

In [14]:
df_reduced.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO
0,20140531562,14053156,CALDERON JUAN DOMINGO,NaN,- -,- -,NaN,NaN
1,27281648867,28164886,BAEZ CECILIA LUJAN,NaN,- -,- -,NaN,NaN
2,20398295383,39829538,CARDOZO SANTIAGO EDUARDO,NaN,- -,- -,NaN,NaN
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4
4,20939121383,93912138,BENEGA LOPEZ ARNALDO ARIEL,NaN,- -,- -,NaN,NaN

# 3) Concatenación de Marca - Modelo

Como PyP envía un teléfono por celda, tengo que concatenar las columnas de teléfonos en una lista dentro de una nueva columna denominada "Dato"

In [15]:
df_reduced.columns

Index(['CUIT_CUIL', 'NRO_DOC', 'Titular', 'PATENTE', 'ANO', 'FECHA_DE_COMPRA',
       'MARCA', 'MODELO'],
      dtype='object')

In [16]:
marca_modelo = df_reduced['MARCA'] + ' ' +df_reduced ['MODELO']

In [17]:
df_reduced = df_reduced.assign(FABRICANTE=marca_modelo)

In [18]:
df_reduced.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE
0,20140531562,14053156,CALDERON JUAN DOMINGO,NaN,- -,- -,NaN,NaN,NaN
1,27281648867,28164886,BAEZ CECILIA LUJAN,NaN,- -,- -,NaN,NaN,NaN
2,20398295383,39829538,CARDOZO SANTIAGO EDUARDO,NaN,- -,- -,NaN,NaN,NaN
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4,PEUGEOT 207 COMPACT XS 1 4
4,20939121383,93912138,BENEGA LOPEZ ARNALDO ARIEL,NaN,- -,- -,NaN,NaN,NaN

In [19]:
#df_reduced.to_excel('test_marca_modelo.xlsx')

# 4) Drop NaNs

Dropeamos aquellas filas que tengan NaN en la columna Dato, ya que no nos aporta nada:

In [20]:
df_reduced = df_reduced.dropna(subset=['PATENTE'])

In [21]:
df_reduced.shape

(466, 9)

In [22]:
df_reduced.tail()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE
1338,27123902446,12390244,BARRIOS NORMA ALICIA,HVF056,2009-02-02 00:00:00,2009-02-02 00:00:00,VOLKSWAGEN,GOL TREND 1 6,VOLKSWAGEN GOL TREND 1 6
1343,27302627830,30262783,CASAS LORENA ELISABET,SZW309,34170,42048,FIAT,SPAZIO TR,FIAT SPAZIO TR
1344,20102706960,10270696,BELMONTE CARLOS OSCAR,DWH971,2002-01-03 00:00:00,2015-03-06 00:00:00,SEAT,LEON 1 6,SEAT LEON 1 6
1346,20344403997,34440399,CABRERA LUIS GUSTAVO,UKG977,27992,42104,RENAULT,R 12,RENAULT R 12
1347,20294121227,29412122,CALLORDA ALBERTO JESUS,GWC037,39464,42752,FORD,FIESTA AMBIENTE MP3,FORD FIESTA AMBIENTE MP3

# 5) Columna Proveedor

Agregamos la columna PROVEEDOR_DATO, con el código correspondiente.

PyP = P2

In [23]:
cod_pyp = 'P2'

In [24]:
df_clean = df_reduced.assign(PROVEEDOR_DATO=cod_pyp)

In [25]:
df_clean.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE,PROVEEDOR_DATO
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4,PEUGEOT 207 COMPACT XS 1 4,P2
6,20277192293,27719229,BENITEZ CRISTIAN GABRIEL,FFO891,38652,42474,HYUNDAI,ELANTRA 2 0 GLS,HYUNDAI ELANTRA 2 0 GLS,P2
7,23222757339,22275733,BONOMETTI CESAR ADRIAN,JUY799,40637,43196,VOLKSWAGEN,TIGUAN 2 0 TSI 4 MOTION,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,P2
15,27176578926,17657892,REBOLLIDO MARCELA ALEJANDRA,KYV415,40973,40973,FORD,ECOSPORT 1 6 L 4X2 XLS,FORD ECOSPORT 1 6 L 4X2 XLS,P2
17,20923312006,92331200,CASTRO PENAYO ANGEL EULALIO,SFI305,34040,40675,MITSUBISHI,LANCER 1500 GLX,MITSUBISHI LANCER 1500 GLX,P2

# 6) Columna Porcentaje

Como no tenemos datos sobre el porcentaje de posesión del vehículo, se asigna 100% a todos los casos

In [26]:
df_clean = df_clean.assign(PORCENTAJE=100)

In [27]:
df_clean.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE,PROVEEDOR_DATO,PORCENTAJE
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4,PEUGEOT 207 COMPACT XS 1 4,P2,100
6,20277192293,27719229,BENITEZ CRISTIAN GABRIEL,FFO891,38652,42474,HYUNDAI,ELANTRA 2 0 GLS,HYUNDAI ELANTRA 2 0 GLS,P2,100
7,23222757339,22275733,BONOMETTI CESAR ADRIAN,JUY799,40637,43196,VOLKSWAGEN,TIGUAN 2 0 TSI 4 MOTION,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,P2,100
15,27176578926,17657892,REBOLLIDO MARCELA ALEJANDRA,KYV415,40973,40973,FORD,ECOSPORT 1 6 L 4X2 XLS,FORD ECOSPORT 1 6 L 4X2 XLS,P2,100
17,20923312006,92331200,CASTRO PENAYO ANGEL EULALIO,SFI305,34040,40675,MITSUBISHI,LANCER 1500 GLX,MITSUBISHI LANCER 1500 GLX,P2,100

# 7) Columna Fecha

Para el campo FECHA_INGRESO_DATO, usamos la fecha en la que se hace la inserción de los datos:

In [28]:
fecha_ingreso = pd.to_datetime('today')

In [29]:
df_clean = df_clean.assign(FECHA_INGRESO=fecha_ingreso)

In [30]:
df_clean.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE,PROVEEDOR_DATO,PORCENTAJE,FECHA_INGRESO
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4,PEUGEOT 207 COMPACT XS 1 4,P2,100,2021-02-24 12:54:16.344810
6,20277192293,27719229,BENITEZ CRISTIAN GABRIEL,FFO891,38652,42474,HYUNDAI,ELANTRA 2 0 GLS,HYUNDAI ELANTRA 2 0 GLS,P2,100,2021-02-24 12:54:16.344810
7,23222757339,22275733,BONOMETTI CESAR ADRIAN,JUY799,40637,43196,VOLKSWAGEN,TIGUAN 2 0 TSI 4 MOTION,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,P2,100,2021-02-24 12:54:16.344810
15,27176578926,17657892,REBOLLIDO MARCELA ALEJANDRA,KYV415,40973,40973,FORD,ECOSPORT 1 6 L 4X2 XLS,FORD ECOSPORT 1 6 L 4X2 XLS,P2,100,2021-02-24 12:54:16.344810
17,20923312006,92331200,CASTRO PENAYO ANGEL EULALIO,SFI305,34040,40675,MITSUBISHI,LANCER 1500 GLX,MITSUBISHI LANCER 1500 GLX,P2,100,2021-02-24 12:54:16.344810

# 8) Columna Fabricante

Se realiza la limpieza de la columna Fabricante, ya que se observan los siguientes problemas:

- Cuando no tiene modelo o marca, se escribe "No Consta". Eso va a parar a Fabricante.
- Al concatenar, se repite el nombre de la Marca en modelo.

In [31]:
df_clean.loc[((df_clean['MARCA'] == 'NO CONSTA')), 'FABRICANTE'] = 'NO CONSTA'

In [32]:
df_clean['FABRICANTE'] = df_clean['FABRICANTE'].str.replace(r'\b(\w+)(\s+\1)+\b', r'\1')

<ipython-input-32-17b773d9a13b>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_clean['FABRICANTE'] = df_clean['FABRICANTE'].str.replace(r'\b(\w+)(\s+\1)+\b', r'\1')

In [33]:
df_clean.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE,PROVEEDOR_DATO,PORCENTAJE,FECHA_INGRESO
3,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4,PEUGEOT 207 COMPACT XS 1 4,P2,100,2021-02-24 12:54:16.344810
6,20277192293,27719229,BENITEZ CRISTIAN GABRIEL,FFO891,38652,42474,HYUNDAI,ELANTRA 2 0 GLS,HYUNDAI ELANTRA 2 0 GLS,P2,100,2021-02-24 12:54:16.344810
7,23222757339,22275733,BONOMETTI CESAR ADRIAN,JUY799,40637,43196,VOLKSWAGEN,TIGUAN 2 0 TSI 4 MOTION,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,P2,100,2021-02-24 12:54:16.344810
15,27176578926,17657892,REBOLLIDO MARCELA ALEJANDRA,KYV415,40973,40973,FORD,ECOSPORT 1 6 L 4X2 XLS,FORD ECOSPORT 1 6 L 4X2 XLS,P2,100,2021-02-24 12:54:16.344810
17,20923312006,92331200,CASTRO PENAYO ANGEL EULALIO,SFI305,34040,40675,MITSUBISHI,LANCER 1500 GLX,MITSUBISHI LANCER 1500 GLX,P2,100,2021-02-24 12:54:16.344810

In [34]:
#df_clean.to_excel('test_marca_modelo_v2.xlsx')

# 9) Concatenación con .csv enviado

Vamos a concatenar nuestro dataframe con el dataframe enviado para enriquecer. Para esto, vamos a hacer una limpieza inicial de cómo se enviaron esos datos. Finalmente, se uniran ambos dataframes por __DNI__.

## 9.1) Dataset: PyP

Vamos a analizar y limpiar el dataset enviado a PyP para el enriquecimiento:

In [35]:
df_pyp = pd.read_excel('/mnt/c/users/Dleg/Data/MOPC/MOPC/Enriquecimiento de Datos/Data Cleaning/PyP/Datasets/Datasets enviados/0209-MOPC-PEDIDO DE DATOS.xlsx')

In [36]:
df_pyp.head()

                  DNI                                    NOMBRE   IDCLIENTE
0  DNI 10039621        ANA MARIA,CANO                            BSR_TARDIA
1  DNI 10197951        BERNARDO,CHAUQUE                          BSR_TARDIA
2  DNI 10248810        CIRO EMIR,BIANCHIMANI                     BSR_TARDIA
3  DNI 10270696        CARLOS OSCARBELMONTE                      BSR_TARDIA
4  DNI 10363397        CALDAS ROSA HAYDEE                        BSR_TARDIA

Dropeamos la última columna que no tiene datos

In [37]:
#df_pyp = df_pyp.drop(columns=['FILTROA'])

In [38]:
df_pyp.head()

                  DNI                                    NOMBRE   IDCLIENTE
0  DNI 10039621        ANA MARIA,CANO                            BSR_TARDIA
1  DNI 10197951        BERNARDO,CHAUQUE                          BSR_TARDIA
2  DNI 10248810        CIRO EMIR,BIANCHIMANI                     BSR_TARDIA
3  DNI 10270696        CARLOS OSCARBELMONTE                      BSR_TARDIA
4  DNI 10363397        CALDAS ROSA HAYDEE                        BSR_TARDIA

Creamos una columna que contenga IDMOROSO + DATOADIC según corresponda

In [39]:
#df_pyp.loc[(df_pyp['IDCLIENTE'].str.startswith('AMEX')) , 'NRO_DOC'] = df_pyp['DATOADIC']

In [40]:
df_pyp = df_pyp.rename(columns={'DNI':'IDMOROSO'})

In [41]:
df_pyp['NRO_DOC'] = df_pyp['IDMOROSO']

In [42]:
df_pyp.head()

,IDMOROSO,NOMBRE,IDCLIENTE,NRO_DOC
0,DNI 10039621,"ANA MARIA,CANO",BSR_TARDIA,DNI 10039621
1,DNI 10197951,"BERNARDO,CHAUQUE",BSR_TARDIA,DNI 10197951
2,DNI 10248810,"CIRO EMIR,BIANCHIMANI",BSR_TARDIA,DNI 10248810
3,DNI 10270696,CARLOS OSCARBELMONTE,BSR_TARDIA,DNI 10270696
4,DNI 10363397,CALDAS ROSA HAYDEE,BSR_TARDIA,DNI 10363397

## 8.2) DNI Cleaning

Limpiamos el dataframe __df_pyp__, ya que dentro de DATO_A_ENVIAR tenemos 9 tipos de casos diferentes de datos:

- DNI 12345678
- DNI12345678
- DNIE1234678
- LC  1234567
- LE  1234567
- CUIT00123456780
- 00123456780 --> Es un CUIT.
- 00 12345678 0 --> Es un CUIT.
- DNI 00123456780 --> Dice DNI pero es un CUIT de una persona __jurídica__ (TO DO)

Para eso definimos 5 funciones:

- __Tipo_DOC__: Se definen dos funciones para determinar el tipo de DNI. Una inicial, y otra para corregir sobre el dataframe resultante.
- __Standard DNI__: Estandariza los DNI para 7 de los casos. Esta función debe ejecutarse en primer lugar.
- __DNI Spaces__: Elimina los espacios.
- __DNI Zero__: Elimina los ceros iniciales de ciertos CUITs para que coincidan con los DNI.
- __Cuit__: Decisión sobre dejar un cuit o volverlo DNI

In [43]:
def tipo_doc_1 (string_dni):
    
    if 'DNI' in string_dni:
        tipo = 'DNI'
    
    elif 'LC' in string_dni:
        tipo = 'LC'
    
    elif 'LE' in string_dni:
        tipo = 'LE'
    
    elif 'DNIE' in string_dni:
        tipo = 'DNIE'    
    
    elif ((string_dni.startswith(('CUIT30','CUIT33','CUIT34'))) & (len(string_dni)>8)):
        tipo = 'CUIT'
        
    elif ((string_dni.startswith(('30','33','34'))) & (len(string_dni)>8)):
        tipo = 'CUIT'

    elif ((string_dni.startswith(('20','23','24','27'))) & (len(string_dni)>8)):
        tipo = 'DNI'

    elif ((string_dni.startswith(('CUIT20','CUIT23','CUIT24','CUIT27'))) & (len(string_dni)>8)):
        tipo = 'DNI'
        
    else:
        tipo = 'DNI'
    
    return tipo

In [44]:
def tipo_doc_2 (string_dni, tipo_original):
    
    if (len(string_dni) > 8) & (tipo_original == 'DNI'):
        tipo = 'CUIT'
    else:
        tipo = tipo_original
    return tipo

In [45]:
def standard_dni (string_dni):
    """DNI separation by each case.
    """
    
    if 'DNI ' in string_dni:
        dni = string_dni.split('DNI ')[1]
        
    elif 'DNIE' in string_dni:
        dni = string_dni.split('DNIE')[1]
    
    elif 'DNI' in string_dni:
        dni = string_dni.split('DNI')[1]
    
    elif 'LC  ' in string_dni:
        dni = string_dni.split('LC  ')[1]
    
    elif 'LE  ' in string_dni:
        dni = string_dni.split('LE  ')[1]
    
    elif 'CUIT' in string_dni:
        dni = string_dni.split('CUIT')[1]
        
    else:
        dni = string_dni
        
    return dni

In [46]:
def dni_characters (string_dni):
    
    if ' ' in string_dni:
        dni = string_dni.replace(' ','')
        
    elif '-' in string_dni:
        dni = string_dni.replace('-','')

    else:
        dni = string_dni
    
    return dni

In [47]:
def cuit (string_dni):
    
    if ((string_dni.startswith('20')) & (len(string_dni)>8)):
        cuit = string_dni [2:-1]
        
    elif ((string_dni.startswith('23')) & (len(string_dni)>8)):
        cuit = string_dni [2:-1]
        
    elif ((string_dni.startswith('24')) & (len(string_dni)>8)):
        cuit = string_dni [2:-1]

    elif ((string_dni.startswith('27')) & (len(string_dni)>8)):
        cuit = string_dni [2:-1]

    else:
        cuit = string_dni
        
    return cuit

In [48]:
def dni_zero (string_dni):
    
    if string_dni.startswith('0'):
        dni = string_dni [1:]

    else:
        dni = string_dni
    
    return dni

En primer lugar, trimmeamos los espacios que sobran:

In [49]:
df_pyp['NRO_DOC'] = [(str(df_pyp['NRO_DOC'][i]).strip()) for i in range (df_pyp['NRO_DOC'].count())]

Se implementan estas funciones:

Para determinar el __TIPO DE DOCUMENTO__ en primer lugar:

In [50]:
df_pyp['TIPO_DOC'] = [tipo_doc_1(df_pyp['NRO_DOC'][i]) for i in range (df_pyp['NRO_DOC'].count())]

Para la limpieza de DNIs:

In [51]:
df_pyp['NRO_DOC'] = [standard_dni(df_pyp['NRO_DOC'][i]) for i in range (df_pyp['NRO_DOC'].count())]

In [52]:
df_pyp['NRO_DOC'] = [dni_characters(df_pyp['NRO_DOC'][i]) for i in range (df_pyp['NRO_DOC'].count())]

In [53]:
df_pyp['NRO_DOC'] = [cuit(df_pyp['NRO_DOC'][i]) for i in range (df_pyp['NRO_DOC'].count())]

In [54]:
df_pyp['NRO_DOC'] = [dni_zero(df_pyp['NRO_DOC'][i]) for i in range (df_pyp['NRO_DOC'].count())]

Para corregir el __TIPO DE DOCUMENTO__ sobre el dataframe resultante

In [55]:
df_pyp['TIPO_DOC'] = [tipo_doc_2(df_pyp['NRO_DOC'][i],df_pyp['TIPO_DOC'][i]) for i in range (df_pyp['NRO_DOC'].count())]

In [56]:
df_pyp.head()

,IDMOROSO,NOMBRE,IDCLIENTE,NRO_DOC,TIPO_DOC
0,DNI 10039621,"ANA MARIA,CANO",BSR_TARDIA,10039621,DNI
1,DNI 10197951,"BERNARDO,CHAUQUE",BSR_TARDIA,10197951,DNI
2,DNI 10248810,"CIRO EMIR,BIANCHIMANI",BSR_TARDIA,10248810,DNI
3,DNI 10270696,CARLOS OSCARBELMONTE,BSR_TARDIA,10270696,DNI
4,DNI 10363397,CALDAS ROSA HAYDEE,BSR_TARDIA,10363397,DNI

# 9) Union de Dataframes

Se unen ambos dataframes en la columna NRO_DOC

Convertimos la columna NRO_DOC de objeto a INT para hacer la unión

In [57]:
df_clean = df_clean.astype({'NRO_DOC': 'str'})

In [58]:
df_union = pd.merge(df_clean,df_pyp, on='NRO_DOC', how='inner')

In [59]:
df_union.shape

(466, 16)

In [60]:
df_union.head()

,CUIT_CUIL,NRO_DOC,Titular,PATENTE,ANO,FECHA_DE_COMPRA,MARCA,MODELO,FABRICANTE,PROVEEDOR_DATO,PORCENTAJE,FECHA_INGRESO,IDMOROSO,NOMBRE,IDCLIENTE,TIPO_DOC
0,20359239530,35923953,BUSTOS CLEVERS CARLOS OCTAVIO,JUQ012,40624,43410,PEUGEOT,207 COMPACT XS 1 4,PEUGEOT 207 COMPACT XS 1 4,P2,100,2021-02-24 12:54:16.344810,DNI 35923953,"CARLOS,BUSTOS CLEVERS",BSR_TARDIA,DNI
1,20277192293,27719229,BENITEZ CRISTIAN GABRIEL,FFO891,38652,42474,HYUNDAI,ELANTRA 2 0 GLS,HYUNDAI ELANTRA 2 0 GLS,P2,100,2021-02-24 12:54:16.344810,DNI 27719229,"CRISTIAN GABRIEL,BENITEZ",BSR_TARDIA,DNI
2,23222757339,22275733,BONOMETTI CESAR ADRIAN,JUY799,40637,43196,VOLKSWAGEN,TIGUAN 2 0 TSI 4 MOTION,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,P2,100,2021-02-24 12:54:16.344810,DNI 22275733,BONOMETTI CESAR ADRIAN,BSR_TARDIA,DNI
3,27176578926,17657892,REBOLLIDO MARCELA ALEJANDRA,KYV415,40973,40973,FORD,ECOSPORT 1 6 L 4X2 XLS,FORD ECOSPORT 1 6 L 4X2 XLS,P2,100,2021-02-24 12:54:16.344810,DNI 17657892,"MARCELA ALEJANDRA,REBOLLIDO",BSR_TARDIA,DNI
4,20923312006,92331200,CASTRO PENAYO ANGEL EULALIO,SFI305,34040,40675,MITSUBISHI,LANCER 1500 GLX,MITSUBISHI LANCER 1500 GLX,P2,100,2021-02-24 12:54:16.344810,DNIE92331200,"ANGEL EULALIO,CASTRO PENAYO",BSR_TARDIA,DNI

# 10) Export

Renombramos, dropeamos y reordenamos las columnas

In [61]:
df_union = df_union.rename(columns = {'PROVEEDOR_DATO':'PROVEEDOR'})

Dropeamos columnas que no nos sirven

In [62]:
#df_export = df_union.drop(columns=['IDCLIENTE','Titular','ESTADO','NOMBRE','MARCA','MODELO','CUIT_CUIL','NRO_DOC','TIPO_DOC'], axis=0)

In [63]:
df_export = df_union[['IDMOROSO','PATENTE','ANO','FABRICANTE','PORCENTAJE','FECHA_INGRESO','PROVEEDOR','FECHA_DE_COMPRA']]

In [64]:
df_export.loc[df_export['FECHA_DE_COMPRA'] == '  -   -','FECHA_DE_COMPRA'] = np.nan

/home/dleg/.pyenv/versions/3.8.6/envs/lewagon/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [65]:
df_export.loc[df_export['ANO'] == '  -   -','ANO'] = np.nan

In [66]:
m = df_export['FECHA_DE_COMPRA'].astype(str).str.isdigit()

In [67]:
n = df_export['ANO'].astype(str).str.isdigit()

In [68]:
from datetime import datetime, timedelta

def from_excel_ordinal(ordinal, _epoch0=datetime(1899, 12, 31)):
    if ordinal >= 60:
        ordinal -= 1  # Excel leap year bug, 1900 is not a leap year!
    return (_epoch0 + timedelta(days=ordinal)).replace(microsecond=0)

In [69]:
df_export.loc[m, 'FECHA_DE_COMPRA'] = df_export.loc[m, 'FECHA_DE_COMPRA'].astype(int).apply(from_excel_ordinal)

/home/dleg/.pyenv/versions/3.8.6/envs/lewagon/lib/python3.8/site-packages/pandas/core/indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [70]:
df_export.loc[n, 'ANO'] = df_export.loc[n, 'ANO'].astype(int).apply(from_excel_ordinal)

In [71]:
df_export.head()

,IDMOROSO,PATENTE,ANO,FABRICANTE,PORCENTAJE,FECHA_INGRESO,PROVEEDOR,FECHA_DE_COMPRA
0,DNI 35923953,JUQ012,2011-03-22 00:00:00,PEUGEOT 207 COMPACT XS 1 4,100,2021-02-24 12:54:16.344810,P2,2018-11-06 00:00:00
1,DNI 27719229,FFO891,2005-10-27 00:00:00,HYUNDAI ELANTRA 2 0 GLS,100,2021-02-24 12:54:16.344810,P2,2016-04-14 00:00:00
2,DNI 22275733,JUY799,2011-04-04 00:00:00,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,100,2021-02-24 12:54:16.344810,P2,2018-04-06 00:00:00
3,DNI 17657892,KYV415,2012-03-05 00:00:00,FORD ECOSPORT 1 6 L 4X2 XLS,100,2021-02-24 12:54:16.344810,P2,2012-03-05 00:00:00
4,DNIE92331200,SFI305,1993-03-12 00:00:00,MITSUBISHI LANCER 1500 GLX,100,2021-02-24 12:54:16.344810,P2,2011-05-12 00:00:00

In [72]:
df_export.shape

(466, 8)

In [73]:
df_export ['FECHA_INGRESO'] = pd.to_datetime(df_export['FECHA_INGRESO'])

<ipython-input-73-b45448763e53>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_export ['FECHA_INGRESO'] = pd.to_datetime(df_export['FECHA_INGRESO'])

In [74]:
df_export ['FECHA_DE_COMPRA'] = pd.to_datetime(df_export['FECHA_DE_COMPRA'])

<ipython-input-74-cff992b9c024>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_export ['FECHA_DE_COMPRA'] = pd.to_datetime(df_export['FECHA_DE_COMPRA'])

In [75]:
df_export.head()

,IDMOROSO,PATENTE,ANO,FABRICANTE,PORCENTAJE,FECHA_INGRESO,PROVEEDOR,FECHA_DE_COMPRA
0,DNI 35923953,JUQ012,2011-03-22 00:00:00,PEUGEOT 207 COMPACT XS 1 4,100,2021-02-24 12:54:16.344810,P2,2018-11-06
1,DNI 27719229,FFO891,2005-10-27 00:00:00,HYUNDAI ELANTRA 2 0 GLS,100,2021-02-24 12:54:16.344810,P2,2016-04-14
2,DNI 22275733,JUY799,2011-04-04 00:00:00,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,100,2021-02-24 12:54:16.344810,P2,2018-04-06
3,DNI 17657892,KYV415,2012-03-05 00:00:00,FORD ECOSPORT 1 6 L 4X2 XLS,100,2021-02-24 12:54:16.344810,P2,2012-03-05
4,DNIE92331200,SFI305,1993-03-12 00:00:00,MITSUBISHI LANCER 1500 GLX,100,2021-02-24 12:54:16.344810,P2,2011-05-12

In [76]:
df_export['ANO'] = pd.DatetimeIndex(df_export['ANO']).year

<ipython-input-76-9f2911c79429>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_export['ANO'] = pd.DatetimeIndex(df_export['ANO']).year

In [77]:
df_export['ANO'] = df_export['ANO'].astype('Int64')

<ipython-input-77-9618756fbbae>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_export['ANO'] = df_export['ANO'].astype('Int64')

In [78]:
#df_export['ANO'] = df_export['ANO'].astype(int, errors='ignore')

In [79]:
df_export.head()

,IDMOROSO,PATENTE,ANO,FABRICANTE,PORCENTAJE,FECHA_INGRESO,PROVEEDOR,FECHA_DE_COMPRA
0,DNI 35923953,JUQ012,2011,PEUGEOT 207 COMPACT XS 1 4,100,2021-02-24 12:54:16.344810,P2,2018-11-06
1,DNI 27719229,FFO891,2005,HYUNDAI ELANTRA 2 0 GLS,100,2021-02-24 12:54:16.344810,P2,2016-04-14
2,DNI 22275733,JUY799,2011,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,100,2021-02-24 12:54:16.344810,P2,2018-04-06
3,DNI 17657892,KYV415,2012,FORD ECOSPORT 1 6 L 4X2 XLS,100,2021-02-24 12:54:16.344810,P2,2012-03-05
4,DNIE92331200,SFI305,1993,MITSUBISHI LANCER 1500 GLX,100,2021-02-24 12:54:16.344810,P2,2011-05-12

In [80]:
df_export.head()

,IDMOROSO,PATENTE,ANO,FABRICANTE,PORCENTAJE,FECHA_INGRESO,PROVEEDOR,FECHA_DE_COMPRA
0,DNI 35923953,JUQ012,2011,PEUGEOT 207 COMPACT XS 1 4,100,2021-02-24 12:54:16.344810,P2,2018-11-06
1,DNI 27719229,FFO891,2005,HYUNDAI ELANTRA 2 0 GLS,100,2021-02-24 12:54:16.344810,P2,2016-04-14
2,DNI 22275733,JUY799,2011,VOLKSWAGEN TIGUAN 2 0 TSI 4 MOTION,100,2021-02-24 12:54:16.344810,P2,2018-04-06
3,DNI 17657892,KYV415,2012,FORD ECOSPORT 1 6 L 4X2 XLS,100,2021-02-24 12:54:16.344810,P2,2012-03-05
4,DNIE92331200,SFI305,1993,MITSUBISHI LANCER 1500 GLX,100,2021-02-24 12:54:16.344810,P2,2011-05-12

## 14.1) Export de dataframe + IDCLIENTE para análisis

In [81]:
#df_union.to_excel('D:/MOPC/Enriquecimiento de Datos/Data Cleaning/PyP/Exports/Vehiculos para analisis/PyP_vehiculos_3012.xlsx')
#df_union.to_csv('D:/MOPC/Enriquecimiento de Datos/Data Cleaning/PyP/Exports/Vehiculos para analisis/PyP_vehiculos_3012.csv')

## 14.2) Insert a tabla DAM_CONTACTABILIDAD:

In [82]:
df_export.to_csv('/mnt/c/Users/Dleg/Data/MOPC/MOPC/Enriquecimiento de Datos/Data Cleaning/PyP/Exports/DAM_VEHICULOS/PyP_DAM_VEHICULOS_2402.csv',index=False)